Repository: oandregal/poss-gl
Catalog: tmx/ch03.tmx
Source language: en
Languages: gl

source: There are two main advantages to using a canned site. The first is server capacity and bandwidth: their servers are beefy boxes sitting on really fat pipes. No matter how successful your project gets, you're not going to run out of disk space or swamp the network connection. The second advantage is simplicity. They have already chosen a bug tracker, a version control system, a mailing list manager, an archiver, and everything else you need to run a site. They've configured the tools, and are taking care of backups for all the data stored in the tools. You don't need to make many decisions. All you have to do is fill in a form, press a button, and suddenly you've got a project web site.
gl: Usar un sitio preconfigurado ou preenlatado ten moitas vantaxes. A primeira é a capacidade do servidor e o largo de banda: os seus servidores son caixas enormes conectadas a cabos moi grosos. Por moito éxito que teña o teu proxecto, nunca vas esgotar o espazo en disco ou colapsar a conexión de rede. A segunda vantaxe é a simplicidade. Xa che van dar escollidos un xestor de incidencias, un sistema de control de versións, un xestor de listas de correo, un arquivo, e calquera outra utilidade que poidas precisar para controlar o teu proxecto. As ferramentas estarán xa configuradas, e serán eles quen se ocupen de facer as copias de seguridade de todos os datos almacenados nas ferramentas. Terás poucas decisións que tomar. Todo o que terás que facer e preencher un formulario, premer un botón, e terás de súpeto un sitio web para o teu proxecto.

source: These are pretty significant benefits. The disadvantage, of course, is that you must accept <emphasis>their</emphasis> choices and configurations, even if something different would be better for your project. Usually canned sites are adjustable within certain narrow parameters, but you will never get the fine-grained control you would have if you set up the site yourself and had full administrative access to the server.
gl: Estes son beneficios significativos dabondo. A desvantaxe, claro, é que ti vas ter que aceptar <emphasis>as súas</emphasis> eleccións e configuracións, aínda que algo diferente puidese ser mellor para o teu proxecto. Xeralmente os sitios preenlatados poden ser axustados dentro dun certo número de parámetros, mais nunca chegarás a ter o control refinado que atinxirías se instalases e configurases por ti mesmo o sitio e tiveses acceso administrativo completo ao servidor.

source: A perfect example of this is the handling of generated files. Certain project web pages may be generated files&mdash;for example, there are systems for keeping FAQ data in an easy-to-edit master format, from which HTML, PDF, and other presentation formats can be generated. As explained in <xref linkend="version-everything"/><phrase output="printed"> earlier in this chapter</phrase>, you wouldn't want to version the generated formats, only the master file. But when your web site is hosted on someone else's server, it may be impossible to set up a custom hook to regenerate the online HTML version of the FAQ whenever the master file is changed. The only workaround is to version the generated formats too, so that they show up on the web site.
gl: Un exemplo perfecto do que digo é o manexo de ficheiros xerados. Algunhas páxinas web do proxecto poden ser ficheiros xerados&mdash;por exemplo, hai sistemas para manter os datos das FAQ nun formato mestre doado de editar, desde o que se poden xerar HTML, PDF, e outros formatos de presentación. Como se explica en <xref linkend="versionea-todo"/><phrase output="printed"> neste mesmo capítulo</phrase>, non deberías pretender versionar os formatos xerados, só o ficheiro mestre. Mais cando o teu sitio web está aloxado no servidor dun terceiro, pode que sexa imposible dispor dun hook personalizado para xerar a versión HTML da FAQ cada vez que se modifique o ficheiro mestre. A única solución será versionar tamén os formatos xerados, para que se poidan publicar no sitio web.

source: There can be larger consequences as well. You may not have as much control over presentation as you would wish. Some of the canned hosting sites allow you to customize your web pages, but the site's default layout usually ends up showing through in various awkward ways. For example, some projects that host themselves at SourceForge have completely customized home pages, but still point developers to their "SourceForge page" for more information. The SourceForge page is what would be the project's home page, had the project not used a custom home page. The SourceForge page has links to the bug tracker, the CVS repository, downloads, etc. Unfortunately, a SourceForge page also contains a great deal of extraneous noise. The top is a banner ad, often an animated image. The left side is a vertical arrangement of links of little relevance to someone interested in the project. The right side is often another advertisement. Only the center of the page is devoted to truly project-specific material, and even that is arranged in a confusing way that often makes visitors unsure of what to click on next.
gl: Pode tamén haber consecuencias máis importantes. Talvez non teñas tanto control sobre a presentación como che gustaría. Algúns dos sitios preenlatados permitiranche personalizar as páxinas web, mais o deseño por defecto da web vaise facer presente en variadas e molestas formas. Por exemplo, algúns dos proxectos hospedados en SourceForge teñen as súas páxinas completamente personalizadas, mais aínda dirixen os desenvolvedores á súa "páxina en SourceForge" para información adicional. A páxina en SourceForge é o que sería a páxina do proxecto se non tivese un sitio web propio. Ten ligazóns ao xestor de incidencias, ao repositorio do CVS, descargas, etc. Por desgraza, unha páxina de SourceForge contén tamén unha certa cantidade de ruído estrano. A parte superior é unha banda publicitaria, e frecuentemente unha imaxe animada. No lado esquerdo contén unha banda de ligazóns de escasa relevancia para quen está interesado no proxecto. O lado dereito contén frecuentemente máis publicidade. Tan só o centro de páxina está dedicado a materiais realmente específicos do proxecto, e mesmo neste caso están dispostos dun xeito confuso que frecuentemente fai que o visitante non saiba onde premer a continuación

source: Behind every individual aspect of SourceForge's design, there is no doubt a good reason&mdash;good from SourceForge's point of view, such as the advertisements. But from an individual project's point of view, the result can be a less-than-ideal web page. I don't mean to pick on SourceForge; similar concerns apply to many of the canned hosting sites. The point is that there's a tradeoff. You get relief from the technical burdens of running a project site, but only at the price of accepting someone else's way of running it.
gl: Detrás de cada aspecto individual do deseño de SourceForge, hai sen dúbida unha boa razón&mdash;boa desde o punto de vista de SourceForge, tal como a publicidade. Mais desde o punto de vista dun proxecto individual, o resultado pode ser unha web máis que afastada do ideal. Non estou a botar pedras contra SourceForge; problemas similares ocorren cos máis dos servizos de hospedaxe enlatada. A cousa é que hai un compromiso. Ficas liberado das cargas técnicas derivadas da xestión do sitio do proxecto, mais polo prezo de teres que aceptar a maneira en que outros decidan como xestionalo.

source: Only you can decide whether canned hosting is best for your project. If you choose a canned site, leave open the option of switching to your own servers later, by using a custom domain name for the project's "home address". You can forward the URL to the canned site, or have a fully customized home page at the public URL and hand users off to the canned site for sophisticated functionality. Just make sure to arrange things such that if you later decide to use a different hosting solution, the project's address doesn't need to change.
gl: Soamente ti podes decidir se os sitios enlatados son a mellor solución para o teu proxecto. Se elixires un sitio enlatado, deixa aberta a posibilidade de migrar aos teus propios servidores máis tarde, empregando un nome de dominio personalizado para a URL do proxecto. Podes reenviar a URL ao sitio enlatado, ou crear unha páxina de inicio completamente persoal na URL pública e mandar os usuarios ao sitio enlatado para faceren uso das funcionalidades sofisticadas. Tan só asegúrate de arranxares as cousas de xeito que se posteriormente decides empregar unha solución de aloxamento distinta, o enderezo do proxecto non teña que ser modificado.

source: Choosing a canned hosting site
gl: Escollendo un sitio enlatado

source: The largest and most well-known hosting site is <ulink url="http://www.sourceforge.net/">SourceForge</ulink>. Two other sites providing the same or similar services are <ulink url="http://savannah.gnu.org/">savannah.gnu.org</ulink> and <ulink url="http://www.berlios.de/">BerliOS.de</ulink>. A few organizations, such as the <ulink url="http://www.apache.org/">Apache Software Foundation</ulink> and <ulink url="http://www.tigris.org/">Tigris.org</ulink><footnote><para>Disclaimer: I am employed by <ulink url="http://www.collab.net/">CollabNet</ulink>, which sponsors Tigris.org, and I use Tigris regularly.</para></footnote>, give free hosting to open source projects that fit well with their missions and their community of existing projects.
gl: O sitio enlatado máis grande e mellor coñecido é <ulink url="http://www.sourceforge.net/">SourceForge</ulink>. Outros dous sitios que fornecen servizos iguais ou similares son <ulink url="http://savannah.gnu.org/">savannah.gnu.org</ulink> e <ulink url="http://www.berlios.de/">BerliOS.de</ulink><footnote><para>Nota do tradutor: en Galiza, o sitio máis coñecido é a <ulink url="https://forxa.mancomun.org/">Forxa de Mancomún</ulink></para></footnote>. Algunhas organizacións, tales como a <ulink url="http://www.apache.org/">Apache Software Foundation</ulink> e <ulink url="http://www.tigris.org/">Tigris.org</ulink><footnote><para>Aviso: eu son empregado de <ulink url="http://www.collab.net/">CollabNet</ulink>, que patrocina a Tigris.org, e emprego Tigris regularmente.</para></footnote>, fornecen aloxamento gratis a proxectos de código aberto que encaixan coas súas misións e coa súa comunidade de proxectos existentes.

source: Haggen So did a thorough evaluation of various canned hosting sites, as part of the research for his Ph.D. thesis, <citetitle>Construction of an Evaluation Model for Free/Open Source Project Hosting (FOSPHost) sites</citetitle>. The results are at <ulink url="http://www.ibiblio.org/fosphost/"></ulink>, and see especially the very readable comparison chart at <ulink url="http://www.ibiblio.org/fosphost/exhost.htm"></ulink>.
gl: Haggen So fixo unha avaliación de varios sitios de aloxamento de proxectos como parte do seu traballo de investigación para a súa tese de doutoramento, <citetitle>Construction of an Evaluation Model for Free/Open Source Project Hosting (FOSPHost) sites</citetitle>. Os resultados están publicados en <ulink url="http://www.ibiblio.org/fosphost/"></ulink>, onde podes ver especialmente a tabela excelente comparativa en <ulink url="http://www.ibiblio.org/fosphost/exhost.htm"></ulink>.

source: Anonymity and involvement
gl: Anonimato e participación

source: A problem that is not strictly limited to the canned sites, but is most often found there, is the abuse of user login functionality. The functionality itself is simple enough: the site allows each visitor to register herself with a username and password. From then on it keeps a profile for that user, and project administrators can assign the user certain permissions, for example, the right to commit to the repository.
gl: Un problema que non se dá só nos sitios enlatados, mais que se ten atopado especialmente neles, é o abuso da funcionalidade de login (rexistro de entrada). En sí mesma é considerablemente simple: o sitio permite que cada visitante se cadastre cun nome de usuario e unha seña. Desde ese momento, mantén un perfil do usuario, e os administradores do proxecto poden asignarlle certos permisos, por exemplo o dereito a achegar mudanzas ao repositorio.

source: This can be extremely useful, and in fact it's one of the prime advantages of canned hosting. The problem is that sometimes user login ends up being required for tasks that ought to be permitted to unregistered visitors, specifically the ability to file issues in the bug tracker, and to comment on existing issues. By requiring a logged-in username for such actions, the project raises the involvement bar for what should be quick, convenient tasks. Of course, one wants to be able to contact someone who's entered data into the issue tracker, but having a field where she can enter her email address (if she wants to) is sufficient. If a new user spots a bug and wants to report it, she'll only be annoyed at having to fill out an account creation form before she can enter the bug into the tracker. She may simply decide not to file the bug at all.
gl: Isto pode ser extremadamente útil e, de feito, é unha das vantaxes principais do aloxamento enlatado. O problema é que ás veces o rexistro de usuario acaba sendo necesario para tarefas que deberían ser permitidas a visitantes non rexistrados, especialmente a capacidade de rexistrar asuntos no xestor de incidencias, e de poder facer comentarios sobre asuntos abertos. Requirindo un nome de usuario rexistrado para tales accións, o proxecto eleva o limiar para o que debería poder facerse de xeito áxil e doado. Por suposto, é interesante poder contactar con quen ten introducido asuntos no xestor de incidencias, mais tendo un campo onde introducir o enderezo de correo-e (se o usuario o desexa) chega dabondo. Se un novo usuario localiza unha incidencia e quere reportala, sentirase molestado por ter que preencher un formulario de creación dunha conta antes de poder rexistrar o asunto no xestor de incidencias. Talvez simplemente renuncie a rexistrar a incidencia.

source: The advantages of user management generally outweigh the disadvantages. But if you can choose which actions can be done anonymously, make sure not only that <emphasis>all</emphasis> read-only actions are permitted to non-logged-in visitors, but also some data entry actions, especially in the bug tracker and, if you have them, wiki pages.
gl: As vantaxes da xestión de usuarios xeralmente ultrapasan as desvantaxes. Mais se podes escoller que accións poden levarse a cabo de xeito anónimo, asegúrate de que non só están permitidas para visitantes non rexistrados<emphasis>todas</emphasis> as accións de só lectura, senón que tamén o están algunhas de entrada de datos, especialmente no xestor de incidencias e, se a tiveres, nas páxinas wiki.
